[{"title":"","date":"2025-10-14T12:22:40.351Z","path":"2025/10/14/z变换/","text":"###实因果信号极点位置与时域特性：#####1.有简单实极点或简单复共轭极点对极点位于单位圆内或之上：其振幅一般有界","tags":[]},{"title":"","date":"2025-10-05T12:29:47.665Z","path":"2025/10/05/离散时间系统的分类/","text":"离散时间系统分类详解：理解数字信号处理的基石一、离散时间系统的分类维度离散时间系统可以根据其输入与输出关系的不同特性，从多个维度进行分类。理解这些分类对于分析系统特性至关重要。 1. 静态（无记忆）系统 vs. 动态（有记忆）系统这个分类标准关注系统的输出是否与过去的输入状态有关。 静态系统：系统在任意时刻 n 的输出 y(n) 只取决于同一时刻的输入 x(n)，与过去或未来的输入无关。构成这种系统的单元通常只包括加法器和乘法器。 例子：y(n) = 5x(n) 或 y(n) = (x(n))²。 动态系统：系统在任意时刻 n 的输出 y(n)，不仅与当前输入 x(n) 有关，还与过去的输入&#x2F;输出有关。这种系统包含记忆元件，如寄存器或延迟单元。 例子：累加器 y(n) = y(n-1) + x(n) 和滑动平均滤波器都是动态系统。 2. 线性系统 vs. 非线性系统这个分类标准关注系统是否满足叠加原理。 一个系统是线性的，当且仅当它同时满足以下两个性质： 齐次性：如果输入 x[n] 产生输出 y[n]，那么输入 a * x[n] 将产生输出 a * y[n]。 可加性：如果输入 x1[n] 产生输出 y1[n]，输入 x2[n] 产生输出 y2[n]，那么输入 x1[n] + x2[n] 将产生输出 y1[n] + y2[n]。 将两者结合，对于线性系统，若 x1[n] → y1[n] 且 x2[n] → y2[n]，则对于任意常数 α 和 β，必有：T[αx1(n) + βx2(n)] = αy1(n) + βy2(n)。 线性系统例子：y(n) = n * x(n)。 非线性系统例子：y(n) = (x(n))²。因为 (a1x1(n) + a2x2(n))² ≠ a1x1(n)² + a2x2(n)²。 注意：形如 y(n) = 4x(n) + 6 的系统被称为增量线性系统，它不满足零输入产生零输出的条件，因此不是严格意义上的线性系统。 3. 时不变系统 vs. 时变系统这个分类标准关注系统的特性是否随时间变化。 时不变系统：系统的参数和操作规则不随时间变化。如果一个输入信号产生一个输出信号，那么当该输入信号被延迟 k 个单位后，输出信号也将会被完全一致地延迟 k 个单位。即，若 y(n) = T[x(n)]，则对于任意整数 k，有 y(n-k) = T[x(n-k)]。 例子：y(n) = x(n) - x(n-1)。 时变系统：系统的特性随时间变化。输入信号的延迟不会导致输出信号产生同等程度的简单延迟。 例子：y(n) = n * x(n) 或 y(n) = x(-n)（取反系统）都是时变系统。 4. 因果系统 vs. 非因果系统这个分类标准关注系统的输出是否依赖于未来的输入，这在实时处理中尤为重要。 因果系统：系统在任意时刻 n 的输出 y(n) 仅取决于当前和过去时刻的输入（即 x(n), x(n-1), x(n-2), …），而与未来的输入（x(n+1), x(n+2), …）无关。物理上可实现的系统通常是因果的。 例子：y(n) = x(n) + x(n-1)。 非因果系统：系统在任意时刻 n 的输出 y(n) 依赖于未来的输入。非因果系统在实时处理中无法实现，但可用于离线处理（如处理已存储的数据）。 例子：y(n) = x(n+1)（单位超前系统）或 y(n) = x(-n)。 5. 稳定系统 vs. 不稳定系统这个分类标准关注系统输入输出的有界性。 稳定系统：当系统的输入是一个有界序列（即存在一个常数 Bx，使得对于所有 n，|x(n)| &lt; Bx）时，系统的输出也必然是一个有界序列（存在常数 By，使得对于所有 n，|y(n)| &lt; By）。这个特性被称为BIBO稳定。 不稳定系统：一个有界的输入可能导致一个无界的输出。在实际应用中，不稳定系统通常需要避免。 对于线性时不变系统，有一个非常简洁的稳定性判据：系统稳定的充分必要条件是其单位冲激响应 h(n) 是绝对可和的，即满足 ∑|h(n)| &lt; ∞（从 n&#x3D;-∞ 到 ∞）。 二、特别的明星：线性时不变系统在理论研究和工程实践中，线性时不变系统 是最重要、最常被研究的一类系统。因为它们同时满足线性和时不变性，使得数学分析和处理变得非常简便。 卷积和表示：任何LTI系统都可以完全由其单位冲激响应 h(n)（即系统对单位脉冲 δ(n) 的响应）来描述。对于任意输入 x(n)，系统的输出 y(n) 可以通过输入信号与单位冲激响应的卷积和来计算：y(n) = x(n) * h(n) = ∑ x(k)h(n-k)。 FIR与IIR系统：根据冲激响应的持续时间，LTI系统可进一步分为： 有限冲激响应系统：h(n) 只在有限时间内非零。 无限冲激响应系统：h(n) 在理论上是无限长的。 因果性判据：一个LTI系统是因果的，当且仅当其冲激响应满足 h(n) = 0（对于所有 n &lt; 0）。 总结离散时间系统的分类为我们提供了一套强大的工具，用以理解和预测系统的行为。我们可以通过以下表格快速回顾： 分类维度 类型1 类型2 关键判断标准 记忆性 静态（无记忆）系统 动态（有记忆）系统 输出是否仅与当前输入有关？ 叠加性 线性系统 非线性系统 是否满足齐次性和可加性？ 时变性 时不变系统 时变系统 输入延迟是否导致输出同等延迟？ 因果性 因果系统 非因果系统 输出是否取决于未来输入？ 稳定性 稳定系统（BIBO） 不稳定系统 有界输入是否产生有界输出？ 冲激响应 FIR系统 IIR系统 冲激响应长度有限还是无限？","tags":[]},{"title":"Hello World","date":"2025-10-04T09:04:48.182Z","path":"2025/10/04/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]